app/views/mods/show.html.erb

SELECT "notes".* FROM "notes" GROUP BY "notes"."lecture_name"
---

<% lecture_groups = Note.all.group(:lecture_name).uniq%>