app/views/notes/index.html.erb

SELECT "notes".* FROM "notes"
---

<% Note.all.each do |note| %>