app/views/notes/show.html.erb

SELECT "notes".* FROM "notes"
---
<h3><%= @note.student.name %>'s Notes<br></h3>
<% Note.all.each do |note| %>