app/views/students/show.html.erb

SELECT "notes".* FROM "notes" WHERE "notes"."student_id" = ? AND "notes"."content" IS NOT NULL  [["student_id", 1]]
---

    <% @student.notes.where.not(content:nil).each do |note|  %>