app/views/instructors/_form.html.erb

  <%= f.label :mod_id %>
  <%= f.collection_select :mod_id, Mod.all, :id, :mod_number %>
---
SELECT "mods".* FROM "mods"