app/views/instructors/show.html.erb

<ul>
  <% @instructor.mods.each do |mod| %>
---
SELECT "mods".* FROM "mods" INNER JOIN "instruct_mods" ON "mods"."id" = "instruct_mods"."mod_id" WHERE "instruct_mods"."instructor_id" = ?  [["instructor_id", 5]]