app/controllers/instructors_controller.rb

INSERT INTO "instructors" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "may"], ["created_at", "2019-05-29 21:52:01.834936"], ["updated_at", "2019-05-29 21:52:01.834936"]]
INSERT INTO "instructors" ("name", "mod_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Migos"], ["mod_id", 5], ["created_at", "2019-05-29 00:53:12.482577"], ["updated_at", "2019-05-29 00:53:12.482577"]]
INSERT INTO "instruct_mods" ("mod_id", "instructor_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["mod_id", 5], ["instructor_id", 9], ["created_at", "2019-05-29 22:07:52.950973"], ["updated_at", "2019-05-29 22:07:52.950973"]]
---
  def create
    @instructor = Instructor.create(name: instructor_params[:name])
     @im = InstructMod.create(instructor_id: @instructor.id, mod_id: instructor_params[:mods])

UPDATE "instructors" SET "name" = ?, "updated_at" = ? WHERE "instructors"."id" = ?  [["name", "drew"], ["updated_at", "2019-05-29 22:09:53.605195"], ["id", 1]]
---
  def update
    @instructor.update(name: instructor_params[:name])

SELECT  "instructors".* FROM "instructors" WHERE "instructors"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def find_instructor
    @instructor = Instructor.find(params[:id])

SELECT  "mods".* FROM "mods" WHERE "mods"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "instruct_mods" ("mod_id", "instructor_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["mod_id", 2], ["instructor_id", 4], ["created_at", "2019-05-30 17:49:57.380040"], ["updated_at", "2019-05-30 17:49:57.380040"]]
---
  def find_or_create_mods
    @found = @instructor.mods.find_by(id: instructor_params[:mods])
      if @found == nil
        InstructMod.create(instructor_id: @instructor.id, mod_id: instructor_params[:mods])