app/controllers/mods_controller.rb

  def index
    @mods = Mod.all
---
SELECT "mods".* FROM "mods"

  def show
    @mod = Mod.find(params[:id])
    i = @mod.id
    @lecture_groups = Note.all.group(:lecture_name).where(@mod[id:i])
    # byebug
    @lecture_groups.uniq
    @lecture_names = @lecture_groups.map{|x| x.lecture_name}
---
SELECT  "mods".* FROM "mods" WHERE "mods"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "notes".* FROM "notes" WHERE "notes"."mod_id" = ? AND "notes"."mod_id" = ?  [["mod_id", 4], ["mod_id", 1]]
SELECT "notes".* FROM "notes" GROUP BY "notes"."lecture_name"