app/controllers/notes_controller.rb

SELECT "notes".* FROM "notes"
---
  def index
    @note = Note.all

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def get_note
   @note = Note.find(params[:id])