app/controllers/students_controller.rb

INSERT INTO "students" ("name", "mod_name", "github_link", "linkedin_link", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @student= Student.new(student_params)
    if @student.valid?
      @student.save

UPDATE "students" SET "mod_start_date" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["mod_start_date", "2019-04-22 00:00:00"], ["updated_at", "2019-05-29 18:43:26.110750"], ["id", 11]]
---
  def update
    @student.update(student_params)